const blogPosts = [
  {
    id: 1,
    image: `assets/img/blog/blog-01.jpg`,
    title: `UGC (User-Generated Content) พลังรีวิวจากลูกค้าจริง 1`,
    sub_title: `การให้ลูกค้าเป็นกระบอกเสียงให้แบรนด์ของคุณ อาจส่งผลดีมากกว่าการโฆษณาแบบเดิม ๆ UGC หรือเนื้อหาที่ผู้ใช้สร้างขึ้นเอง เช่น รีวิวสินค้า วิดีโอแกะกล่อง หรือโพสต์จากลูกค้าจริง สามารถสร้างความน่าเชื่อถือ และกระตุ้นการตัดสินใจซื้อได้ดีกว่าที่คุณคิด`,
  },
  {
    id: 2,
    image: `assets/img/blog/blog-02.jpg`,
    title: `UGC (User-Generated Content) พลังรีวิวจากลูกค้าจริง 2`,
    sub_title: `การให้ลูกค้าเป็นกระบอกเสียงให้แบรนด์ของคุณ อาจส่งผลดีมากกว่าการโฆษณาแบบเดิม ๆ UGC หรือเนื้อหาที่ผู้ใช้สร้างขึ้นเอง เช่น รีวิวสินค้า วิดีโอแกะกล่อง หรือโพสต์จากลูกค้าจริง สามารถสร้างความน่าเชื่อถือ และกระตุ้นการตัดสินใจซื้อได้ดีกว่าที่คุณคิด`,
  },
  {
    id: 3,
    image: `assets/img/blog/blog-03.jpg`,
    title: `UGC (User-Generated Content) พลังรีวิวจากลูกค้าจริง 3`,
    sub_title: `การให้ลูกค้าเป็นกระบอกเสียงให้แบรนด์ของคุณ อาจส่งผลดีมากกว่าการโฆษณาแบบเดิม ๆ UGC หรือเนื้อหาที่ผู้ใช้สร้างขึ้นเอง เช่น รีวิวสินค้า วิดีโอแกะกล่อง หรือโพสต์จากลูกค้าจริง สามารถสร้างความน่าเชื่อถือ และกระตุ้นการตัดสินใจซื้อได้ดีกว่าที่คุณคิด`,
  },
  {
    id: 4,
    image: `assets/img/blog/blog-04.jpg`,
    title: `UGC (User-Generated Content) พลังรีวิวจากลูกค้าจริง 4`,
    sub_title: `การให้ลูกค้าเป็นกระบอกเสียงให้แบรนด์ของคุณ อาจส่งผลดีมากกว่าการโฆษณาแบบเดิม ๆ UGC หรือเนื้อหาที่ผู้ใช้สร้างขึ้นเอง เช่น รีวิวสินค้า วิดีโอแกะกล่อง หรือโพสต์จากลูกค้าจริง สามารถสร้างความน่าเชื่อถือ และกระตุ้นการตัดสินใจซื้อได้ดีกว่าที่คุณคิด`,
  },
  {
    id: 5,
    image: `assets/img/blog/blog-01.jpg`,
    title: `UGC (User-Generated Content) พลังรีวิวจากลูกค้าจริง 5`,
    sub_title: `การให้ลูกค้าเป็นกระบอกเสียงให้แบรนด์ของคุณ อาจส่งผลดีมากกว่าการโฆษณาแบบเดิม ๆ UGC หรือเนื้อหาที่ผู้ใช้สร้างขึ้นเอง เช่น รีวิวสินค้า วิดีโอแกะกล่อง หรือโพสต์จากลูกค้าจริง สามารถสร้างความน่าเชื่อถือ และกระตุ้นการตัดสินใจซื้อได้ดีกว่าที่คุณคิด`,
  },
  {
    id: 6,
    image: `assets/img/blog/blog-02.jpg`,
    title: `UGC (User-Generated Content) พลังรีวิวจากลูกค้าจริง 6`,
    sub_title: `การให้ลูกค้าเป็นกระบอกเสียงให้แบรนด์ของคุณ อาจส่งผลดีมากกว่าการโฆษณาแบบเดิม ๆ UGC หรือเนื้อหาที่ผู้ใช้สร้างขึ้นเอง เช่น รีวิวสินค้า วิดีโอแกะกล่อง หรือโพสต์จากลูกค้าจริง สามารถสร้างความน่าเชื่อถือ และกระตุ้นการตัดสินใจซื้อได้ดีกว่าที่คุณคิด`,
  },
  {
    id: 7,
    image: `assets/img/blog/blog-03.jpg`,
    title: `UGC (User-Generated Content) พลังรีวิวจากลูกค้าจริง 7`,
    sub_title: `การให้ลูกค้าเป็นกระบอกเสียงให้แบรนด์ของคุณ อาจส่งผลดีมากกว่าการโฆษณาแบบเดิม ๆ UGC หรือเนื้อหาที่ผู้ใช้สร้างขึ้นเอง เช่น รีวิวสินค้า วิดีโอแกะกล่อง หรือโพสต์จากลูกค้าจริง สามารถสร้างความน่าเชื่อถือ และกระตุ้นการตัดสินใจซื้อได้ดีกว่าที่คุณคิด`,
  },
  {
    id: 8,
    image: `assets/img/blog/blog-04.jpg`,
    title: `UGC (User-Generated Content) พลังรีวิวจากลูกค้าจริง 8`,
    sub_title: `การให้ลูกค้าเป็นกระบอกเสียงให้แบรนด์ของคุณ อาจส่งผลดีมากกว่าการโฆษณาแบบเดิม ๆ UGC หรือเนื้อหาที่ผู้ใช้สร้างขึ้นเอง เช่น รีวิวสินค้า วิดีโอแกะกล่อง หรือโพสต์จากลูกค้าจริง สามารถสร้างความน่าเชื่อถือ และกระตุ้นการตัดสินใจซื้อได้ดีกว่าที่คุณคิด`,
  },
  {
    id: 9,
    image: `assets/img/blog/blog-01.jpg`,
    title: `UGC (User-Generated Content) พลังรีวิวจากลูกค้าจริง 9`,
    sub_title: `การให้ลูกค้าเป็นกระบอกเสียงให้แบรนด์ของคุณ อาจส่งผลดีมากกว่าการโฆษณาแบบเดิม ๆ UGC หรือเนื้อหาที่ผู้ใช้สร้างขึ้นเอง เช่น รีวิวสินค้า วิดีโอแกะกล่อง หรือโพสต์จากลูกค้าจริง สามารถสร้างความน่าเชื่อถือ และกระตุ้นการตัดสินใจซื้อได้ดีกว่าที่คุณคิด`,
  },
  {
    id: 10,
    image: `assets/img/blog/blog-02.jpg`,
    title: `UGC (User-Generated Content) พลังรีวิวจากลูกค้าจริง 10`,
    sub_title: `การให้ลูกค้าเป็นกระบอกเสียงให้แบรนด์ของคุณ อาจส่งผลดีมากกว่าการโฆษณาแบบเดิม ๆ UGC หรือเนื้อหาที่ผู้ใช้สร้างขึ้นเอง เช่น รีวิวสินค้า วิดีโอแกะกล่อง หรือโพสต์จากลูกค้าจริง สามารถสร้างความน่าเชื่อถือ และกระตุ้นการตัดสินใจซื้อได้ดีกว่าที่คุณคิด`,
  },
  {
    id: 11,
    image: `assets/img/blog/blog-03.jpg`,
    title: `UGC (User-Generated Content) พลังรีวิวจากลูกค้าจริง 11`,
    sub_title: `การให้ลูกค้าเป็นกระบอกเสียงให้แบรนด์ของคุณ อาจส่งผลดีมากกว่าการโฆษณาแบบเดิม ๆ UGC หรือเนื้อหาที่ผู้ใช้สร้างขึ้นเอง เช่น รีวิวสินค้า วิดีโอแกะกล่อง หรือโพสต์จากลูกค้าจริง สามารถสร้างความน่าเชื่อถือ และกระตุ้นการตัดสินใจซื้อได้ดีกว่าที่คุณคิด`,
  },
  {
    id: 12,
    image: `assets/img/blog/blog-04.jpg`,
    title: `UGC (User-Generated Content) พลังรีวิวจากลูกค้าจริง 12`,
    sub_title: `การให้ลูกค้าเป็นกระบอกเสียงให้แบรนด์ของคุณ อาจส่งผลดีมากกว่าการโฆษณาแบบเดิม ๆ UGC หรือเนื้อหาที่ผู้ใช้สร้างขึ้นเอง เช่น รีวิวสินค้า วิดีโอแกะกล่อง หรือโพสต์จากลูกค้าจริง สามารถสร้างความน่าเชื่อถือ และกระตุ้นการตัดสินใจซื้อได้ดีกว่าที่คุณคิด`,
  },
  {
    id: 13,
    image: `assets/img/blog/blog-01.jpg`,
    title: `UGC (User-Generated Content) พลังรีวิวจากลูกค้าจริง 13`,
    sub_title: `การให้ลูกค้าเป็นกระบอกเสียงให้แบรนด์ของคุณ อาจส่งผลดีมากกว่าการโฆษณาแบบเดิม ๆ UGC หรือเนื้อหาที่ผู้ใช้สร้างขึ้นเอง เช่น รีวิวสินค้า วิดีโอแกะกล่อง หรือโพสต์จากลูกค้าจริง สามารถสร้างความน่าเชื่อถือ และกระตุ้นการตัดสินใจซื้อได้ดีกว่าที่คุณคิด`,
  },
  {
    id: 14,
    image: `assets/img/blog/blog-02.jpg`,
    title: `UGC (User-Generated Content) พลังรีวิวจากลูกค้าจริง 14`,
    sub_title: `การให้ลูกค้าเป็นกระบอกเสียงให้แบรนด์ของคุณ อาจส่งผลดีมากกว่าการโฆษณาแบบเดิม ๆ UGC หรือเนื้อหาที่ผู้ใช้สร้างขึ้นเอง เช่น รีวิวสินค้า วิดีโอแกะกล่อง หรือโพสต์จากลูกค้าจริง สามารถสร้างความน่าเชื่อถือ และกระตุ้นการตัดสินใจซื้อได้ดีกว่าที่คุณคิด`,
  },
  {
    id: 15,
    image: `assets/img/blog/blog-03.jpg`,
    title: `UGC (User-Generated Content) พลังรีวิวจากลูกค้าจริง 15`,
    sub_title: `การให้ลูกค้าเป็นกระบอกเสียงให้แบรนด์ของคุณ อาจส่งผลดีมากกว่าการโฆษณาแบบเดิม ๆ UGC หรือเนื้อหาที่ผู้ใช้สร้างขึ้นเอง เช่น รีวิวสินค้า วิดีโอแกะกล่อง หรือโพสต์จากลูกค้าจริง สามารถสร้างความน่าเชื่อถือ และกระตุ้นการตัดสินใจซื้อได้ดีกว่าที่คุณคิด`,
  },
  {
    id: 16,
    image: `assets/img/blog/blog-04.jpg`,
    title: `UGC (User-Generated Content) พลังรีวิวจากลูกค้าจริง 16`,
    sub_title: `การให้ลูกค้าเป็นกระบอกเสียงให้แบรนด์ของคุณ อาจส่งผลดีมากกว่าการโฆษณาแบบเดิม ๆ UGC หรือเนื้อหาที่ผู้ใช้สร้างขึ้นเอง เช่น รีวิวสินค้า วิดีโอแกะกล่อง หรือโพสต์จากลูกค้าจริง สามารถสร้างความน่าเชื่อถือ และกระตุ้นการตัดสินใจซื้อได้ดีกว่าที่คุณคิด`,
  },
];

// ดึง id จาก query string
const urlParams = new URLSearchParams(window.location.search);
const postId = parseInt(urlParams.get("id"));

console.log("postId", postId);

const post = blogPosts.find((p) => p.id === postId);

if (post) {
  console.log("post", post);

  document.getElementById("post-detail").innerHTML = `
        <img src="${post.image}" alt="services" class="img-fluid rounded shadow-sm" />
                            <div class="services-detail-content mt-4">
                                <h2>${post.title}</h2>
                                <p>${post.sub_title}</p>
                            </div>
    `;
} else {
  document.getElementById(
    "post-detail"
  ).innerHTML = `<p>ไม่พบข้อมูลบทความ</p>`;
}

